<?php
$day_name = [
    'الأحد',
    'الإثنين',
    'الثلاثاء',
    'الأربعاء',
    'الخميس',
    'الجمعة',
    'السبت',
];
$gender_labels = [
    ['طالبة', 'طالب', 'st'],
    ['طالبات', 'طلاب', 'sts'],
    ['معلمة', 'معلم', 't'],
    ['معلمات', 'معلمين', 'ts'],
    ['دار', 'مجمع', 'e'],
    ['دور', 'إدارات', 'es'],
    ['إدارية / معلمة بديلة', 'إداري / معلم بديل', 'emp'],
    ['إداريات / معلمات بديلات', 'إداريون / معلمون بدلاء', 'emps'],
    ['مختبرات', 'مختبرون', 'mks'],
    ['المعلمة المختبرة', 'المعلم المختبر', 'mktbr'],
    ['مجتازات', 'مجتازون', 'najeh'],
    ['مستلمة', 'مستلم', 'mstlm'],
];

$session_sex = 2;
if (isset($_SESSION['sex'])) {
    $session_sex = $_SESSION['sex'];
}
$statusName = [
    [0, "الموعد لم يحدد"],
    [1, "مقبول"],
    [2, "ناجح"],
    [3, "لم يجتز"],
    [4, "غائب"],
    [5, "غائب بعذر للطالب"],
    [6, "غائب بعذر للمجمع"],
];
if ($session_sex == 0) {
    $statusName = [
        [0, "الموعد لم يحدد"],
        [1, "مقبولة"],
        [2, "ناجحة"],
        [3, "لم تجتز"],
        [4, "غائبة"],
        [5, "غائبة بعذر للطالبة"],
        [6, "غائبة بعذر للدار"],
    ];
}

$murtaqaName = [
    [8, "الفاتحة (النظام القديم)"],
    ["", "حدد المرتقى..."],
    [1, "الملك"],
    [2, "ق"],
    [3, "الزمر"],
    [4, "النمل"],
    [5, "الكهف"],
    [6, "يونس"],
    [7, "المائدة"],
    [9, "الفاتحة (تجويد)"],
    [10, "الفاتحة (بدون تجويد)"],
];

$bra3mName = ["Null"                /* 0 */,
    "القارعة"                /* 1 */,
    "الشمس"                    /* 2 */,
    "المطففين"                /* 3 */,
    "النبأ"                /* 4 */,
    "الجن"                /* 5 */,
    "مرتقى الملك"                /* 6 */];

$murtaqaEndSora = [
    0                  /*-*/,
    67                /*الملك*/,
    50                /*ق*/,
    39                /*الزمر*/,
    27                /*المنل*/,
    18                /*الكهف*/,
    10                /*يونس*/,
    5                 /*المائدة*/,
    1                 /*الفاتحة*/,
    1                 /*الفاتحة 20 مقطع*/,
    1                 /*الفاتحة 20 مقطع بدون تجويد*/,
];

$mudeerTanfethee = "عبدالرحمن بن خالد الحربي";
$raeesJam3iah = 'عبدالرحمن بن محمد الحمد';
$maliah_edariah = 'عبدالرحمن بن عبدالعزيز النصار';
$ameen_sondooq = 'فهد بن سعود العامر';
$ertiqa_mudeer = 'عبدالمحسن بن محمد القشعمي';
$jameiahName = "الجمعية الخيرية لتحفيظ القرآن الكريم بمحافظة الزلفي";
$reportHeaderText = "";

//$mudeerEshraf = "حصة بنت عبدالرحمن الطوالة";
$mudeerEshraf = "نورة بنت فهد الحمدة";
$mushrefErtiqa = "نورة بنت ناصر الجبر";

$soraName = ["Null", "الفاتحة", "البقرة", "آل عمران", "النساء", "المائدة", "الأنعام", "الأعراف", "الأنفال", "التوبة", "يونس", "هود", "يوسف", "الرعد", "إبراهيم", "الحجر", "النحل", "الإسراء", "الكهف", "مريم", "طـه", "الأنبياء", "الحج", "المؤمنون", "النور", "الفرقان", "الشعراء", "النمل", "القصص", "العنكبوت", "الروم", "لقمان", "السجدة", "الأحزاب", "سبأ", "فاطر", "يس", "الصافات", "ص", "الزمر", "غافر", "فصلت", "الشورى", "الزخرف", "الدخان", "الجاثية", "الأحقاف", "محمد", "الفتح", "الحجرات", "ق", "الذاريات", "الطور", "النجم", "القمر", "الرحمن", "الواقعة", "الحديد", "المجادلة", "الحشر", "الممتحنة", "الصف", "الجمعة", "المنافقون", "التغابن", "الطلاق", "التحريم", "الملك", "القلم", "الحاقة", "المعارج", "نوح", "الجن", "المزمل", "المدثر", "القيامة", "الإنسان", "المرسلات", "النبأ", "النازعات", "عبس", "التكوير", "الإنفطار", "المطففين", "الإنشقاق", "البروج", "الطارق", "الأعلى", "الغاشية", "الفجر", "البلد", "الشمس", "الليل", "الضحى", "الشرح", "التين", "العلق", "القدر", "البيِنة", "الزلزلة", "العاديات", "القارعة", "التكاثر", "العصر", "الهمزة", "الفيل", "قريش", "الماعون", "الكوثر", "الكافرون", "النصر", "المسد", "الإخلاص", "الفلق", "الناس"];

$SchoolLevelName = [
    "غير ملتحق"                /* 0 */,
    "روضة"                /* 1 */,
    "تمهيدي"                    /* 2 */,
    "أول ابتدائي"                /* 3 */,
    "ثاني ابتدائي"                /* 4 */,
    "ثالث ابتدائي"                /* 5 */];

/*السنة الدراسية للمشاركين في المسابقات*/
$SchoolLevelNameAll = [
    ["", "حدد السنة الدراسية..."],
    [14, "المرحلة التمهيدية"],
    [0, "أول ابتدائي"],
    [1, "ثاني ابتدائي"],
    [2, "ثالث ابتدائي"],
    [3, "رابع ابتدائي"],
    [4, "خامس ابتدائي"],
    [5, "سادس ابتدائي"],
    [6, "أول متوسط"],
    [7, "ثاني متوسط"],
    [8, "ثالث متوسط"],
    [9, "أول ثانوي"],
    [10, "ثاني ثانوي"],
    [11, "ثالث ثانوي"],
    [12, "جامعي"],
    [15, "موظفين / أمهات"],
    [13, 'غير ملتحق'],
];

$fahd_MsbkhType = [
    ["", "حدد نوع المسابقة..."],
    [7, "حلقات"],
    [0, "جزأين (دنيا)"],
    [1, "جزأين (عليا)"],
    [2, "خمس أجزاء"],
    [3, "عشرة أجزاء"],
    [4, "عشرون جزءاَ"],
    [5, "القرآن كاملا"],
    [6, "مزامير آل داود"],
    [8, "أصغر حافظ"],
];

/*فروع مسابقة أمير الرياض*/
$etqan_msbkh_type = [
    [2, "15 جزءَا ثانوي"],
    [4, "15 جزءَا متوسط"],
    [9, "جزأين ابتدائي"],
    [7, "10 أجزاء ابتدائي"],
    /*الأعلى لا يعرض في قائمة الاختيار وذلك بتحديد البداية من رقم أربعة*/
    ["", "حدد نوع المسابقة..."],
    [10, "القرآن الكريم مع التفسير"],
    [0, "القرآن الكريم كاملا"],
    [1, "20 جزءَا ثانوي فما فوق"],
    [3, "10 أجزاء ثانوي فما فوق"],
    [5, "10 أجزاء متوسط"],
    [6, "5 أجزاء متوسط"],
    [8, "5 أجزاء ابتدائي"],
    [11, "3 أجزاء ابتدائي"],
];

/*فروع برنامج متقن*/
$mutqin_msbkh_type = [
    ["", "حدد الفرع..."],
    [10, "3 أجزاء ابتدائي"],
    [20, "5 أجزاء ابتدائي ومتوسط"],
    [30, "10 أجزاء متوسط وثانوي"],
    [40, "20 جزءَا ثانوي فما فوق"],
    [50, "القرآن كاملا (جميع المراحل)"],
    [60, "الصوت الندي (جميع المراحل)"],
];

$shabab_msbkh_type = [
    ["", "حدد نوع المسابقة..."],
    [0, "20 جزءَا"],
    [1, "10 أجزاء"],
    [2, "5 أجزاء"],
];

//مسابقة الملك سلمان
$salman_msbkh_type = [
    ["", "حدد نوع المسابقة..."],
    [10, "القرآن الكريم كاملا مع التفسير"],
    [20, "القرآن الكريم كاملا"],
    [30, "20 جزءَا"],
    [40, "10 أجزاء"],
    [50, "5 أجزاء"],
];

//	نوع المتسابقة
$MtsabikType = [
    [0, 'أساسي'],
    [1, 'احتياط'],
];


$MarkName_Long = [
    ['أ+', 'ممتاز مرتفع'],
    ['أ', 'ممتاز'],
    ['ب+', 'جيد جدا مرتفع'],
    ['ب', 'جيد جدا'],
    ['ج+', 'جيد مرتفع'],
    ['ج', 'جيد'],
    ['د', 'راسب'],
];


$user_groups = [
    ["", "حدد الصلاحية..."],
    ["admin", "كامل الصلاحيات"],
    ["t3lem", "الشؤون التعليمية"],
    ["er", "مسؤول المرتقيات"],
    ["ms", "مسؤول المسابقات"],
    ["mktbr", "معلم مختبر"],
    ["edarh", "مجمع أو دار"],
];


$teacher_types = [
    [1, "غير محدد"],
    ["", "حدد التصنيف ..."],
    [14, "معلمة تمهيدي بالدور"],
    [2, "معلم/ـة صف أول"],
    [3, "معلم/ـة صف ثاني"],
    [4, "معلم/ـة صف ثالث"],
    [5, "معلم/ـة صفوف دنيا مختلط"],
    [6, "معلم/ـة صفوف عليا"],
    [7, "معلم/ـة ابتدائي ومتوسط"],
    [8, "معلم/ـة متوسط فما فوق"],
    [9, "معلم/ـة حلقة تميز"],
    [10, "معلم/ـة حلقة مهرة"],
    [11, "معلم/ـة حلقة تنافس"],
    [12, "معلم/ـة حلقة رياحين"],
    [13, "معلم/ـة حلقة (موظفين / أمهات)"],
];

$all_groups_space = 'admin t3lem er ms mktbr edarh alaqat';

$all_groups = "admin,edarh,er,ms,mktbr,t3lem,alaqat";

/*حالة التسجيل في مسابقة أمير الرياض*/
$etqan_open_g = true;/*السماح للتسجيل للبنات*/
$etqan_open_b = true;/*السماح للتسجيل للبنين*/
$etqan_birth_date_b = 14150626;
$etqan_birth_date_g = 14050626;


/*حالة التسجيل في برنامج متقن*/
$mutqin_open_g = false;/*السماح للتسجيل للبنات*/
$mutqin_open_b = true;/*السماح للتسجيل للبنين*/
$mutqin_birth_date_b = 14150602;
$mutqin_birth_date_g = 14050626;


$nationality = [
    ['', 'حدد الجنسية...'],
    [1, 'سعودي'],
    [26, 'مصري'],
    [15, 'سوري'],
    [7, 'باكستاني'],
    [2, 'اردني'],
    [3, 'افغانى'],
    [4, 'البانى'],
    [5, 'اماراتي'],
    [6, 'اندونيسي'],
    [8, 'بحرينى'],
    [9, 'بنجلاديشى'],
    [10, 'تركي'],
    [11, 'تونسي'],
    [12, 'جزائرى'],
    [13, 'جنوب افريقي'],
    [14, 'سوداني'],
    [16, 'سيرلانكي'],
    [17, 'صومالي'],
    [18, 'عراقي'],
    [19, 'عماني'],
    [20, 'فليبيني'],
    [21, 'فليسطيني'],
    [22, 'قطري'],
    [23, 'كويتي'],
    [24, 'لبناني'],
    [25, 'ماليزي'],
    [27, 'مغربي'],
    [28, 'موريتاني'],
    [29, 'هندي'],
    [30, 'يمني'],
];
//تأنيث الجنسية
if ($session_sex == 0) {
    for ($i = 1, $len = count($nationality); $i < $len; $i++) {
        $nationality[$i][1] .= 'ة';
    }
}

$halakah_time = [
    ['', 'حدد وقت الحلقة'],
    [10, 'الفجر'],
    [20, 'الصباح'],
    [30, 'الظهر'],
    [40, 'العصر'],
    [50, 'المغرب'],
    [60, 'العشاء'],
];

$halakah_type = [
    ['', 'حدد نوع الحلقة'],
    [10, 'تميز'],
    [20, 'صفوف أولية(١)'],
    [30, 'صفوف أولية(٢)'],
    [40, 'صفوف أولية(٣)'],
    [60, 'صفوف عليا'],
    [70, 'مرحلة متوسطة'],
    [80, 'مرحلة ثانوية'],
    [90, 'مرحلة جامعية'],
    [100, 'مهرة'],
    [101, 'مسار مهرة'],
    [110, 'موظفين/أمهات'],
];

$qualification = [
    ['', 'حدد المؤهل العلمي...'],
    [10, 'الشهادة الإبتدائية فما دون'],
    [20, 'متوسط'],
    [30, 'ثانوي'],
    [40, 'دبلوم'],
    [50, 'جامعي'],
    [60, 'ماجستير'],
    [70, 'دكتوراه'],
    [80, 'غير ملتحق'],
];

if ($session_sex == 0) {
    $job = [
        ['', 'حددي العمل ...'],
        [10, 'مديرة'],
        [20, 'مساعدة'],
        [30, 'مشرفة تربوية'],
        [31, 'مرشدة طلابية'],
        [40, 'إدارية'],
        [50, 'معلمة بديلة'],
        [60, 'معلمة مساعدة'],
    ];
} else {
    $job = [
        ['', 'حدد العمل ...'],
        [10, 'مدير'],
        [20, 'مساعد'],
        [30, 'مشرف تربوي'],
        [31, 'مرشد طلابي'],
        [40, 'إداري'],
        [50, 'معلم بديل'],
        [60, 'معلم مساعد'],
    ];
}

$yes_no = [
    'لا',
    'نعم',
];