<?php
include("includeSettings.php");			//םֽÊזם ו׀ו ַבַבדבÝ Úבל ּדםÚ ֵÚַַֿֿÊ ַבֵׁ׃ַב ַבֶׁם׃םו
$mobile = ""; 							//ַ׃ד ַבד׃Ê־ֿד דה דזַָםבם
$password = "";							//ַבַָ׃זֿׁ  דה דזַָםבם
$activetCode = "";                     	//ßזֿ ַבÊÝÚםב ַב׀ם Êד ֵ׃Êבַדו Úבל ַבּזַב
$senderId = "";                         //ַבÞםדֹ ַבÚֿֿםו ַבהַÊּו דה Úדבםֹ ״בָ ÊÝÚםב ׁÞד ַבּזַב ßֵ׃ד דׁ׃ב¡ זָֿזה ַבׁדׂ (#)¡ זßדַֻב Ýֵה ַבׁÞד #110 םָּ ֵׁ׃ַבו Úבל ַבװßב 110

$resultType = 0;						//ַֿבֹ Êֽֿםֿ הזÚ ַבהÊםּו ַבַּׁÚו דה ַבָזַָֹ
										//0: ֵַּׁÚ ַבהÊםּו ßדַ ום Ýם ַבָזַָֹ
										//1: ֵַּׁÚ דÚהל ַבהÊםּו ַבַּׁÚו דה ַבָזַָֹ	

// ַֿבֹ ÊÝÚםב ׁÞד ַבּזַב ßֵ׃ד דׁ׃ב
echo activeSender($mobile,$password,$senderId,$activetCode,$resultType);
?>