<?php
include("includeSettings.php");			//םֽÊזם ו׀ו ַבַבדבÝ Úבל ּדםÚ ֵÚַַֿֿÊ ַבֵׁ׃ַב ַבֶׁם׃םו
$mobile = ""; 							//ַ׃ד ַבד׃Ê־ֿד דה דזַָםבם
$password = "";							//ַבַָ׃זֿׁ  דה דזַָםבם
$sender = "NEW SMS";                 	//ַ׃ד ַבדׁ׃ב ַבדַֿׁ ÊÝÚםבו¡ זםָּ ֳה בַ םÊַּזׂ ״זבו 11 ֽׁÝ זַָבֵהּבםׂםו ÝÞ״

$resultType = 0;						//ַֿבֹ Êֽֿםֿ הזÚ ַבהÊםּו ַבַּׁÚו דה ַבָזַָֹ
										//0: ֵַּׁÚ ַבהÊםּו ßדַ ום Ýם ַבָזַָֹ
										//1: ֵַּׁÚ דÚהל ַבהÊםּו ַבַּׁÚו דה ַבָזַָֹ	

echo addAlphaSender($mobile,$password,$sender,$resultType);
?>