<?php
include("includeSettings.php");			//םֽÊזם ו׀ו ַבַבדבÝ Úבל ּדםÚ ֵÚַַֿֿÊ ַבֵׁ׃ַב ַבֶׁם׃םו
$mobile = ""; 							//ַ׃ד ַבד׃Ê־ֿד דה דזַָםבם
$password = "";							//ַבַָ׃זֿׁ  דה דזַָםבם
$sender = "96650000000";				//ׁÞד ַבּזַב ַב׀ם Êׁםֿ ÊÝÚםבו בבֵׁ׃ַב ָו¡ זםָּ ßÊַָֹ ַבׁÞד ַָבױםÛֹ ַבֿזבםֹ דֻב 96650555555

$resultType = 0;						//ַֿבֹ Êֽֿםֿ הזÚ ַבהÊםּו ַבַּׁÚו דה ַבָזַָֹ
										//0: ֵַּׁÚ ַבהÊםּו ßדַ ום Ýם ַבָזַָֹ
										//1: ֵַּׁÚ דÚהל ַבהÊםּו ַבַּׁÚו דה ַבָזַָֹ	

// ַֿבֹ ״בָ ÊÝÚםב ׁÞד ַבּזַב ßֵ׃ד דׁ׃ב
echo addSender($mobile,$password,$sender,$resultType);
?>