<?php
include("includeSettings.php");			//םֽÊזם ו׀ו ַבַבדבÝ Úבל ּדםÚ ֵÚַַֿֿÊ ַבֵׁ׃ַב ַבֶׁם׃םו
$mobile = ""; 							//ַ׃ד ַבד׃Ê־ֿד דה דזַָםבם
$password = "";							//ַבַָ׃זֿׁ  דה דזַָםבם
$deleteKey = "";                     	//ׁÞד ַבֵׁ׃ַבםו ַבדַֿׁ ֽ׀וַ¡ זוז הÝ׃ו ַבׁÞד ַב׀ם Êד Êדׁםׁ ֵבל ָזַָֹ ַבֵׁ׃ַב Ýם ַבÞםדֹ: deleteKey

$resultType = 0;						//ַֿבֹ Êֽֿםֿ הזÚ ַבהÊםּו ַבַּׁÚו דה ַבָזַָֹ
										//0: ֵַּׁÚ ַבהÊםּו ßדַ ום Ýם ַבָזַָֹ
										//1: ֵַּׁÚ דÚהל ַבהÊםּו ַבַּׁÚו דה ַבָזַָֹ	

// ַֿבֹ ÊÝÚםב ׁÞד ַבּזַב ßֵ׃ד דׁ׃ב
echo deleteSMS($mobile,$password,$deleteKey,$resultType);
?>