<?php
include("includeSettings.php");			//םֽÊזם ו׀ו ַבַבדבÝ Úבל ּדםÚ ֵÚַַֿֿÊ ַבֵׁ׃ַב ַבֶׁם׃םו
$mobile = ""; 							//ַ׃ד ַבד׃Ê־ֿד בֽ׃ַָß Ýם דזÞÚ דזַָםבם
$sendtype = 1;							//ַֿבֹ Êֽֿםֿ דßַה ֵׁ׃ַב ßבדֹ ַבדׁזׁ
										//1: ֵׁ׃ַב ßבדֹ ַבדׁזׁ Úבל ַבּזַב
										//2: ֵׁ׃ַב ßבדֹ ַבדׁזׁ Úבל ַבֵםדםב¡ זםָּ ÊזÝׁ ַבֵםדםב ַָבװßב ַבױֽםֽ ײדה ַבדÚבזדַÊ ַבװ־ױםו Ýם ַבדזÞÚ

$resultType = 0;						//ַֿבֹ Êֽֿםֿ הזÚ ַבהÊםּו ַבַּׁÚו דה ַבָזַָֹ
										//0: ֵַּׁÚ ַבהÊםּו ßדַ ום Ýם ַבָזַָֹ
										//1: ֵַּׁÚ דÚהל ַבהÊםּו ַבַּׁÚו דה ַבָזַָֹ	

// ַֿבֹ ֵ׃ÊַּׁÚ ßבדֹ ַבדׁזׁ
echo forgetPassword($mobile,$sendtype,$resultType);
?>