<?php
include("includeSettings.php");
//يحتوي هذه الالملف على جميع إعدادات الإرسال الرئيسيه

$mobile = "966559955114";
//اسم المستخدم من موبايلي

$password = "Klm124816";
//الباسورد  من موبايلي

$sender = "0559955114";
//اسم المرسل الذي سيظهر عند ارسال الرساله، ويتم تشفيره إلى  بشكل تلقائي إلى نوع التشفير (urlencode)

$numbers = "966559955114";
//يجب كتابة الرقم بالصيغة الدولية مثل 96650555555 وعند الإرسال إلى أكثر من رقم يجب وضع الفاصلة (,) وهي التي عند حرف الواو بين كل رقمين 
//لا يوجد عدد محدد من الأرقام التي يمكنك الإرسال لها في حال تم الإرسال من خلال بوابة fsockpoen  أو بوابة CURL،
//ولكن في حال تم الإرسال من خلال بوابة fOpen ، فإنه يمكنك الإرسال إلى 120 رقم فقط في كل عملية إرسال


$msgR = "تحويل
رسالة";
$msg = iconv("UTF-8","Windows-1256",$msgR);
/*SendSMS ارسال الرساله بصيغة اليونيكود يتم تحويل الرسالة داخل الفنكشن 
الرساله العربيه  70 حرف
الرساله الانجليزيه 160 حرف
في حال ارسال اكثر من رساله عربيه فان الرساله الواحده تحسب 67
والرساله الانجليزي 158
الترميز الخاص بالرساله يجب أن يكون Windows-1256
وفي حال كان غير ذلك يجب إستخدام دالة ICONV لتحويل الترميز
*/

$timeSend = 0;
//لتحديد وقت الإرساليه - 0 تعني الإرسال الآن
//الشكل القياسي للوقت هو hh:mm:ss

$dateSend = 0;
//لتحديد تاريخ الإرساليه - 0 تعني الإرسال الآن
//الشكل القياسي للتاريخ هو mm:dd:yyyy

$deleteKey = 152485;
//يمكنك من خلال هذه القيمة  القيمه يمكنك من خلالها حذف الرساله من خلال بوابة حذف الرسائل.
//يمكنك تحديد رقم واحد لمجموعه من الإرساليات، بحيث يتم حذفها دفعه واحده.

$resultType = 0;
//دالة تحديد نوع النتيجه الراجعه من البوابة
//0: إرجاع النتيجه كما هي في البوابة
//1: إرجاع معنى النتيجه الراجعه من البوابة
// دالة الإرسال

?>
<!doctype html>
<html>
<head>
<meta charset="utf-8">
<title>Untitled Document</title>
</head>

<body>
<?php if(sendSMS($mobile,$password,$numbers,$sender,$msg,$timeSend,$dateSend,$deleteKey,$resultType)==1){echo 'تم الإرسال بنجاح';} ?>
</body>
</html>