<?php
include("includeSettings.php");
//нЌ жн е–е «б«бгбЁ Џбм ћгнЏ ≈Џѕ«ѕ«  «б≈—”«б «б—∆н”не

$mobile = "966559955114";
//«”г «бг” ќѕг гд гж»«нбн

$password = "Klm124816";
//«б»«”ж—ѕ  гд гж»«нбн

$sender = "0559955114";
//«”г «бг—”б «б–н ”нўе— Џдѕ «—”«б «б—”«бе° жн г  ‘Ён—е ≈бм  »‘яб  бё«∆н ≈бм джЏ «б ‘Ён— (urlencode)

$numbers = "966559955114";
//нћ» я «»… «б—ёг »«б’нџ… «бѕжбн… гЋб 96650555555 жЏдѕ «б≈—”«б ≈бм √яЋ— гд —ёг нћ» ж÷Џ «бЁ«’б… (,) жен «б н Џдѕ Ќ—Ё «бж«ж »нд яб —ёгнд 
//б« нжћѕ Џѕѕ гЌѕѕ гд «б√—ё«г «б н нгядя «б≈—”«б бе« Ён Ќ«б  г «б≈—”«б гд ќб«б »ж«»… fsockpoen  √ж »ж«»… CURL°
//жбяд Ён Ќ«б  г «б≈—”«б гд ќб«б »ж«»… fOpen ° Ё≈де нгядя «б≈—”«б ≈бм 120 —ёг ЁёЎ Ён яб Џгбн… ≈—”«б


$msgR = "”Ў—\r\nћѕнѕfsockopen";
$msg = iconv("UTF-8","Windows-1256",$msgR);
/*SendSMS «—”«б «б—”«бе »’нџ… «бнждняжѕ н г  Ќжнб «б—”«б… ѕ«ќб «бЁдя‘д 
«б—”«бе «бЏ—»не  70 Ќ—Ё
«б—”«бе «б«дћбн“не 160 Ќ—Ё
Ён Ќ«б «—”«б «яЋ— гд —”«бе Џ—»не Ё«д «б—”«бе «бж«Ќѕе  Ќ”» 67
ж«б—”«бе «б«дћбн“н 158
«б —гн“ «бќ«’ »«б—”«бе нћ» √д няжд Windows-1256
жЁн Ќ«б я«д џн— –бя нћ» ≈” ќѕ«г ѕ«б… ICONV б Ќжнб «б —гн“

*/
$timeSend = 0;
//б Ќѕнѕ жё  «б≈—”«бне - 0  Џдн «б≈—”«б «б¬д
//«б‘яб «бён«”н ббжё  еж hh:mm:ss

$dateSend = 0;
//б Ќѕнѕ  «—нќ «б≈—”«бне - 0  Џдн «б≈—”«б «б¬д
//«б‘яб «бён«”н бб «—нќ еж mm:dd:yyyy

$deleteKey = 152485;
//нгядя гд ќб«б е–е «бёнг…  «бёнге нгядя гд ќб«бе« Ќ–Ё «б—”«бе гд ќб«б »ж«»… Ќ–Ё «б—”«∆б.
//нгядя  Ќѕнѕ —ёг ж«Ќѕ бгћгжЏе гд «б≈—”«бн« ° »ЌнЋ н г Ќ–Ёе« ѕЁЏе ж«Ќѕе.

$resultType = 1;
//ѕ«б…  Ќѕнѕ джЏ «бд нће «б—«ћЏе гд «б»ж«»…
//0: ≈—ћ«Џ «бд нће яг« ен Ён «б»ж«»…
//1: ≈—ћ«Џ гЏдм «бд нће «б—«ћЏе гд «б»ж«»…
// ѕ«б… «б≈—”«б
echo sendSMS($mobile,$password,$numbers,$sender,$msg,$timeSend,$dateSend,$deleteKey,$resultType);

?>