<?php
include("includeSettings.php");							//нЌ жн е–е «б«бгбЁ Џбм ћгнЏ ≈Џѕ«ѕ«  «б≈—”«б «б—∆н”не
$mobile = "";											//«”г «бг” ќѕг гд гж»«нбн
$password = "";											//«б»«”ж—ѕ  гд гж»«нбн

$sender = "NEW SMS";									//«”г «бг—”б «б–н ”нўе— Џдѕ «—”«б «б—”«бе° жн г  ‘Ён—е ≈бм  »‘яб  бё«∆н ≈бм джЏ «б ‘Ён— (urlencode)

$numbers = "";											//нћ» я «»… «б—ёг »«б’нџ… «бѕжбн… гЋб 96650555555 жЏдѕ «б≈—”«б ≈бм √яЋ— гд —ёг нћ» ж÷Џ «бЁ«’б… (,) жен «б н Џдѕ Ќ—Ё «бж«ж »нд яб —ёгнд 
														//б« нжћѕ Џѕѕ гЌѕѕ гд «б√—ё«г «б н нгядя «б≈—”«б бе« Ён Ќ«б  г «б≈—”«б гд ќб«б »ж«»… fsockpoen  √ж »ж«»… CURL°
														//жбяд Ён Ќ«б  г «б≈—”«б гд ќб«б »ж«»… fOpen ° Ё≈де нгядя «б≈—”«б ≈бм 120 —ёг ЁёЎ Ён яб Џгбн… ≈—”«б
														//гб«Ќўе е«ге: Џѕѕ «б√—ё«г нћ» √д н”«жн Џѕѕ «б—”«∆б Ён msgKey

$msg = "г—Ќ»« »я √ќн (1)°  «—нќ ≈‘ —«яя бџ«н… (2)";		//«бё«б» «бЏ«г

$msgKey = "(1),*,гЌгѕ,@,(2),*,12/10/2008***(1),*,√Ќгѕ,@,(2),*,10/10/2008";	/*  «бёнг «б Џжн÷не° жЁнг« нбн  Ё«’нб «б—гж“
																				Х	(1)° (2)°...: ббѕб«бе Џбм «б—гж“ «б н нћ» «б Џжн÷ Џде« 
																				Х	*  Ё’б »нд «б—г“ «бгЎбж» ≈” »ѕ«бе Ён «б—”«бе ж«бёнг… «бг” »ѕб »е«.
																				Х	@  Ё’б »нд  Џ—нЁ «б—г“ «б√жб жёнг е ж«б—г“ «бЋ«дн жёнг е.
																				Х	***  Ё’б »нд ёнг «б—”«бе «б√жбм жёнг «б—”«бе «бЋ«дне.
																				
																				гб«Ќў«  Џбм Џгбн… «б≈—”«б »≈” ќѕ«г «бёж«б»
																				sendSMSWK «—”«б «б—”«бе »’нџ… «бнждняжѕ н г  Ќжнб «б—”«б… ѕ«ќб «бЁдя‘д 
																				
																				яб —”«бе »«ббџ… «бЏ—»не  70 Ќ—Ё
																				яб —”«бе »«ббџ… «б«дћбн“не 160 Ќ—Ё
																				Ён Ќ«б «—”«б «яЋ— гд —”«бе Џ—»не Ё«д «б—”«бе «бж«Ќѕе  Ќ”» 67
																				ж«б—”«бе «б«дћбн“н 158
																				*/
									
$timeSend = 0;							//б Ќѕнѕ жё  «б≈—”«бне - 0  Џдн «б≈—”«б «б¬д
										//«б‘яб «бён«”н ббжё  еж hh:mm:ss

$dateSend = 0;							//б Ќѕнѕ  «—нќ «б≈—”«бне - 0  Џдн «б≈—”«б «б¬д
										//«б‘яб «бён«”н бб «—нќ еж mm/dd/yyyy
										
$deleteKey = 152485;					//нгядя гд ќб«б е–е «бёнг…  «бёнге нгядя гд ќб«бе« Ќ–Ё «б—”«бе гд ќб«б »ж«»… Ќ–Ё «б—”«∆б.
										//нгядя  Ќѕнѕ —ёг ж«Ќѕ бгћгжЏе гд «б≈—”«бн« ° »ЌнЋ н г Ќ–Ёе« ѕЁЏе ж«Ќѕе.
										
$resultType = 0;						//ѕ«б…  Ќѕнѕ джЏ «бд нће «б—«ћЏе гд «б»ж«»…
										//0: ≈—ћ«Џ «бд нће яг« ен Ён «б»ж«»…
										//1: ≈—ћ«Џ гЏдм «бд нће «б—«ћЏе гд «б»ж«»…											

// ѕ«б… ≈—”«б —”«∆б «бёж«б»
echo sendSMSWK($mobile,$password,$numbers,$sender,$msg,$msgKey,$timeSend,$dateSend,$deleteKey,$resultType);
?>